import { Box, Container, Typography } from "@mui/material";
import PageHeader from "../../../components/PageHeader";
import Image from "next/image";

function ImportingKoiFromJapanPage() {
  return (
    <Container
      maxWidth="lg"
      sx={{
        display: "flex",
        flexDirection: "column",
        justifyContent: "center",
        gap: "50px",
      }}
    >
      <Box sx={{ marginX: "8%" }}>
        <PageHeader text="ไปซื้อปลาที่ญี่ปุ่น ควรไปกับใคร และมีค่าใช้จ่ายอะไรบ้าง ?" />
      </Box>
      <Box sx={{ display: "flex", justifyContent: "center" }}>
        <Image
          src="/img/blogs/importing-koi-from-japan/blog5-1.png"
          alt="importing-koi-from-japan-banner"
          width={400}
          height={5250}
          style={{
            width: "80%",
            height: "auto",
          }}
        />
      </Box>

      <Box sx={{ marginX: "10%" }}>
        <Typography variant="h4" sx={{ whiteSpace: "pre-line" }}>
          การไปซื้อปลาจากฟาร์มที่ญี่ปุ่น
          หากเป็นนักเลี้ยงทั่วไปที่ไม่เคยมีประสบการณ์ ควรไปกับผู้ที่มีประสบการณ์
          และผู้ที่มีประสบการณ์ก็คงหนีไม่พ้น
          ฟาร์มปลาหรือดีลเลอร์ที่เป็นผู้นำเข้าปลา
          <br />
          <br />
        </Typography>
        <Typography variant="body1">
          จะเลือกไปกับฟาร์มไหน ดีลเลอร์ท่านใด ก็แล้วแต่ความสนิทชิดเชื้อ
          แต่เหนือสิ่งอื่นใดแล้ว ต้องเลือกกลุ่มที่มีสไตล์การเลือกปลาที่ตรงกัน
          ดีลเลอร์บางคนนิยมหาปลาเล็กราคาไม่สูง บางคนชอบเข้าฟาร์มขนาดกลาง
          บางคนวันนึงเข้าออกหลายฟาร์ม
          บางคนวันนึงเข้าไม่กี่ฟาร์มแต่เข้าแต่ละฟาร์มใช้เวลานานๆ
          ในขณะที่บางคนชอบเข้าฟาร์มขนาดใหญ่อย่างเดียว
          และเน้นปลาคุณภาพดีหรือปลาประกวด แต่ละกลุ่มต่างมีรายละเอียดของตนเอง
          การพูดคุยกันล่วงหน้าให้ชัดเจน จะทำให้เกิดความสบายใจด้วยกันทั้งสองฝ่าย
          <br />
          <br />
          ในการเดินทางไปญี่ปุ่น
          เจ้าของฟาร์มหรือดีลเลอร์ที่เป็นหัวหน้าคณะจะเป็นคนวางแผนทั้งหมด
          ทั้งเรื่องการเลือกไฟลท์บิน ระดับชั้นบิน จัดเตรียมเรื่องที่พัก รถเช่า
          และวางแผนการเดินทางตลอดทริป ตลอดจนเรื่องการกินการอยู่ในแต่ละวัน
          ซึ่งเรื่องค่าใช้จ่ายปลีกย่อยและงบประมาณเหล่านี้
          (ไม่นับรวบงบประมาณในการซื้อปลา) ควรสอบถามให้ชัดเจน
          ว่าจะต้องเตรียมไปเท่าไหร่
          <br />
          <br />
          อีกสิ่งหนึ่งที่สำคัญคือก็คือ
          เมื่อไปถึงญี่ปุ่นแล้วเวลาจะเดินทางเข้าฟาร์ม
          จำเป็นอย่างยิ่งที่จะต้องมีผู้ประสานงาน
          หรือคนกลางที่เป็นชาวญี่ปุ่นไปด้วย
          คนๆนี้ไม่เพียงแต่ต้องพูดภาษาญี่ปุ่นได้
          เพราะบรีดเดอร์หลายๆฟาร์มใช้ภาษาญี่ปุ่นได้อย่างเดียว
          ไม่ใช้ภาษาอังกฤษสื่อสารเลย และต้องรู้จักเส้นทางเป็นอย่างดี
          นอกจากนี้ยังต้องเป็นคนที่บรีดเดอร์คุ้นเคยและเชื่อใจ
          <br />
          <br />
          นอกจากนี้ในบางกรณี ผู้ประสานงานจะทำหน้าที่อำนวยความสะดวกด้านต่างๆ
          จองโรงแรมที่พัก เลือกร้านอาหาร
          หรือมากไปกว่านั้นก็อาจจะให้คำแนะนำในเรื่องการเลือกปลาหรือซื้อปลา
          <br />
          <br />
          การทำธุรกิจซื้อขายปลา จะต้องผ่านผู้ประสานชาวญี่ปุ่น
          ทั้งเรื่องการจ่ายเงิน การจัดการเรื่อง packing การทำ Health Certificate
          ตลอดจนการขนส่งปลาทั้งหมดจากฟาร์มไปจนถึงสนามบินเพื่อส่งมายังเมืองไทย
          สำหรับค่าเหนื่อยหรือค่าดำเนินการของผู้ประสานงาน
          จะมีทั้งชาร์จเพิ่มทางฝั่งคนซื้อ
          อาจเป็นเปอร์เซ็นต์จากราคาปลาหรือเหมารวม ก็แล้วแต่ตกลงกัน
          ซึ่งจุดนี้ต้องสอบถามรายละเอียดกันให้ชัดเจน
          <br />
          <br />
          หากได้ผู้ประสานงานที่ดี มีคอนเน็คชั่นที่กว้างขวาง
          ได้รับการนับถือจากบรีดเดอร์
          นอกจากการต้อนรับขับสู้อย่างดีจากบรีดเดอร์แล้ว
          ก็ยังมีโอกาสที่จะได้เลือกปลาดีๆหรือปลาสวยๆที่ซุกซ่อนไว้
          ตลอดจนการได้รับคำแนะนำที่ดีในการเลือกซื้อปลา
        </Typography>
      </Box>
    </Container>
  );
}

export default ImportingKoiFromJapanPage;
