import { Box, Container, Typography } from "@mui/material";
import PageHeader from "../../../components/PageHeader";
import Image from "next/image";

function KoiHuntingTips1() {
  return (
    <Container maxWidth="lg">
      <Box sx={{ marginX: "8%" }}>
        <PageHeader text="Koi hunting tips 1" />
      </Box>

      <Box sx={{ marginY: 10, marginX: "10%" }}>
        <Typography variant="h3">
          ฝากเลี้ยงที่ญี่ปุ่น (Azukari) ตอนที่ 1
        </Typography>
        <Typography
          variant="body1"
          sx={{ whiteSpace: "pre-line", marginTop: 5 }}
        >
          ฤดูนิไซเริ่มแล้ว...
          ตอนนี้ถนนทุกสายของคนรักปลาคาร์ฟต่างมุ่งหน้าไปยังประเทศญี่ปุ่น
          ดินแดนแห่งปลาคาร์ฟ หลังจากเลือกซื้อปลากันตลอดสองเดือน
          ปลาจำนวนมากที่ถูกซื้อจะถูกส่งกลับมายังเมืองไทย
          เพื่อให้นักเลี้ยงได้นำไปเลี้ยงกัน
        </Typography>
        <Typography
          variant="body2"
          sx={{ whiteSpace: "pre-line", marginTop: 5 }}
        >
          แต่...จะมีปลาบางส่วนที่ถูกซื้อแล้วไม่ได้ขนส่งมายังเมืองไทย
          แต่ฝากเลี้ยงต่อที่ญี่ปุ่น...
          <br />
          <br />
          ในความเป็นจริงแล้ว
          เรื่องการซื้อปลาแล้วฝากเลี้ยงที่ญี่ปุ่นนั้นมีมานานแล้ว
          เหตุผลหลักๆก็คือ งานประกวดที่ยิ่งใหญ่ที่สุดของโลกปลาคาร์ฟ ที่ถือเป็น
          Top of the world และได้รับการยอมรับว่ามีมาตรฐานสูงที่สุดของโลก ก็คือ
          งาน All Japan Koi Show ที่จัดโดยสมาคม Shinkokai ( All Japan Nishikigoi
          Promotion Association)
          ที่เป็นองค์กรร่วมก่อตั้งโดยBreedersและผู้ประกอบการค้าปลาคาร์ฟ
          วัตถุประสงค์คือส่งเสริมและพัฒนาวงการปลาคาร์ฟในประเทศญี่ปุ่นและประชาสัมพันธ์ขยายความนิยมไปทั่วโลก
          โดยเป็นผู้จัดงานประกวดปลาคาร์ฟระดับโลกที่สำคัญอย่าง All Japan Koi Show
          ( Ajks, full size), All Japan Young Koi Show (Ajyks, max 63Bu), และ
          International Junior Koi Show (Ijks, max 36Bu) เป็นต้น
          นอกจากนี้ก็ยังมีงานประกวดอีกมากมายเช่นงานที่จัดโดยสมาคม ZNA
          และงานประกวดในท้องถิ่นต่างๆ
          <br />
          <br />
          ความฝันหนึ่งของคนเลี้ยงปลาคาร์ฟที่ชอบความท้าทายและการแข่งขัน
          นอกจากการประกวดในประเทศแล้ว ก็คือการส่งปลาประกวดที่ญี่ปุ่น
          ที่ได้ชื่อว่าเป็นประเทศต้นกำเนิดของปลาคาร์ฟ
          <br />
          <br />
          แต่ปลาที่จะเข้าประกวดในงานที่ญี่ปุ่นได้
          ปลาตัวนั้นๆจะต้องอยู่ในญี่ปุ่นเท่านั้น
          เพราะประเทศญี่ปุ่นมีกฏหมายห้ามนำเข้าปลาคาร์ฟ นี่จึงเป็นที่มาว่า
          ทำไมซื้อปลาที่ญี่ปุ่นและต้องฝากเลี้ยงที่นั่นเลย
          เพราะถ้าซื้อแล้วเอากลับมาเมืองไทย
          จะไม่มีโอกาสนำกลับเข้าไปในประเทศญี่ปุ่นอีกแล้ว
          เพราะฉะนั้นเมื่อซื้อปลาคุณภาพสูงแล้ว หลายคนจึงเลือกที่จะคว้า “โอกาส”
          ตรงนี้ ในเมื่อปลาของเรามีศักยภาพ สามารถส่งประกวดในงานที่ญี่ปุ่นได้
          ทำไมจึงไม่เลี้ยงที่นั้นแล้วส่งประกวดล่ะ?
          นี่คือเหตุผลหลักของการซื้อปลาแล้วฝากเลี้ยงที่ญี่ปุ่น
          <br />
          <br />
          เนื่องจากปลาคาร์ฟมีอายุยืนยาว และมีการเจริญเติบโต
          พร้อมๆกับการพัฒนาโครงสร้าง คุณภาพสี และลวดลายในทุกๆช่วงอายุ
          ปลาบางตัวมีศักยภาพที่จะเป็นปลาสวยในอนาคต แต่วันนี้ยังไม่พร้อม
          จำเป็นต้องมีการเลี้ยงภายใต้คอนดิชั่นที่ดี
          เพื่อให้ปลาแสดงศักยภาพสูงสุดออกมา จนพร้อมประกวด
        </Typography>
        <Box sx={{ mx: { xs: 0, md: "20%", xl: "30%" }, my: 5 }}>
          <Image
            src="/img/blogs/koi-hunting-tips-1/blog6-1.png"
            alt="blog1-0"
            width={800}
            height={500}
            style={{
              width: "100%",
              height: "auto",
            }}
          />
        </Box>

        <Typography
          variant="body2"
          sx={{ whiteSpace: "pre-line", marginTop: 5 }}
        >
          ที่สำคัญคือ ต้องยอมรับว่า เทคนิคการเลี้ยงของฟาร์มต่างๆ
          และสภาพแวดล้อมของญี่ปุ่นนั้น เหนือกว่าบ้านเรา
          และเอื้อต่อการทำให้ปลาแสดงศักยภาพสูงสุดออกมา
          เลี้ยงที่บ้านเรายังไงก็ไม่สวยเท่าเลี้ยงที่ญี่ปุ่น
          นักเลี้ยงบางคนที่ซื้อปลาคุณภาพสูง อาจจะไม่ต้องการประกวด
          แต่ต้องการเห็นปลาของตัวเองมีการพัฒนาอย่างเต็มศักยภาพ
          หรือพูดง่ายๆคืออยากเห็นปลาตัวเองโตมาแล้วสวยที่สุดนั่นเอง
          <br />
          <br />
          ภาพ: Nattana Supaton @The 50th All Japan Koi Show as the Award
          presenter.
          <br />
          Cr ภาพ: Jane Maneerat
          <br />
          <br />
          #ikeake2025 #koi #koimartfarm #ajks
        </Typography>
      </Box>
    </Container>
  );
}

export default KoiHuntingTips1;
