import { Box, Container, Grid, Typography } from "@mui/material";
import PageHeader from "../../../components/PageHeader";
import Image from "next/image";

function HowToChooseKoiPage() {
  return (
    <Container maxWidth="lg">
      <Box sx={{ marginX: "8%" }}>
        <PageHeader text="ธรรมเนียมการเลือกซื้อปลาที่ญี่ปุ่น" />
      </Box>

      <Box sx={{ marginY: 10, marginX: "10%" }}>
        <Typography
          variant="body2"
          sx={{ whiteSpace: "pre-line", marginTop: 5 }}
        >
          ตอนนี้ก็ถึงเวลาจะเข้าไปเลือกซื้อปลาที่ฟาร์มกันแล้ว
          สำหรับการเข้าฟาร์มที่ญี่ปุ่นนั้น จะต้องมีการนัดหมายล่วงหน้า
          (ตามแผนการเดินทางที่หัวหน้าคณะวางไว้)
          คนญี่ปุ่นขึ้นชื่อมากในเรื่องวินัยและการตรงต่อเวลา
          ดังนั้นการเข้าฟาร์มจะต้องไปให้ตรงเวลา ปลาที่ Breeder
          จะให้เราดูนั้นจะอยู่ในบ่อปูนใน Greenhouse หรือโรงเรือน หากสนิทกันกับ
          Breeder มาก ๆ ก็อาจจะขอไปร่วมการลากปลาจากบ่อดิน
          ก็จะมีโอกาสได้ชมและหมายตาปลาที่ถูกใจข้าง ๆ บ่อดินนั้นเลย
          ธรรมเนียมในการซื้อปลา หรืออาจจะเรียกว่ามารยาทก็ได้ จะต้องรู้ทั้งเขา
          รู้ทั้งเรา เพื่อให้การซื้อขายเป็นไปอย่างราบรื่น
          และเกิดความสบายใจด้วยกันทั้งสองฝ่าย
          <br />
          <br />
          1. ถ้าชอบหรือถูกใจปลาตัวไหน ควรสอบถามราคา
          เพื่อเช็คว่างบประมาณที่เราตั้งไว้ในใจกับราคาที่ Breeder
          ตั้งใจจะขายนั้นใกล้เคียงกันไหม ไม่ควรตักปลาขึ้นมาดูโดยพลการ
          สนใจตัวไหนควรบอกให้ Breeder ตักให้ และไม่ควรให้ Breeder
          ตักปลาขึ้นมาดูเล่น ๆ จนกว่าจะแน่ใจว่าเป็นตัวที่ชอบและสนใจจะซื้อจริง ๆ
          เพราะการตักปลาขึ้นมาใส่อ่างไฟเบอร์นั้น
          มีโอกาสที่จะทำให้ปลาเสียหายได้นอกจากนี้
          หากไม่ใช่ปลาที่เราได้ทำการตกลงซื้อขายแล้ว ก็ไม่ควรถ่ายรูปหรือวิดีโอ
          บางคนเห็นปลาสวย ๆ ก็อดไม่ได้ที่จะถ่ายรูปหรือวิดีโอ ตรงนี้ไม่ควรทำครับ
          หรือถ้าอยากถ่ายเก็บไว้ดูศึกษาจริง ๆ ก็อาจจะต้องขออนุญาตทาง Breeder
          ก่อนว่าเขาสะดวกใจไหม อย่างไรก็ตาม
          ไม่ควรนำรูปหรือวิดีโอปลาเหล่านั้นไปโพสต์ลงในสื่อต่าง ๆ
          กรณีที่เราไม่ได้ตกลงซื้อปลาตัวนั้น
          <br />
          <br />
          2. สำหรับลูกค้าที่มีงบมากหน่อย อยากได้ปลา premium แบบที่ Breeder
          ไม่ได้นำมาโชว์ไว้ในบ่อทั่วไป Breeder
          บางฟาร์มอาจจะถามเราก่อนว่าเราต้องการปลาในงบประมาณเท่าไหร่
          หรืออาจจะประเมินจากการพูดคุยก็จะรู้ว่าผู้ซื้อมีงบประมาณเท่าไหร่
          แล้วเขาจึงจะพาเราไปยังโรงเรือนที่เก็บปลาเกรดนั้น ๆ หรือราคานั้น ๆ
          บางครั้งก็จะตักปลาขึ้นมาให้เราเลือกหลาย ๆ ตัว
          หรือเพียงไม่กี่ตัวก็แล้วแต่สไตล์การขายของ Breeder แต่ละคน
          <br />
          <br />
          3. ต้องยอมรับว่าปลาดีที่เพาะขึ้นมาในแต่ละปีนั้นมีไม่มาก Breeder
          จึงจำเป็นต้องเก็บปลาดีไว้ให้ลูกค้าคนสำคัญที่มีกำลังซื้อสูง
          หรือลูกค้าที่ซื้อขายกันมายาวนาน ตรงนี้เป็นเรื่องธรรมดา
          โดยธรรมเนียมแล้ว Breeder จะไม่พาไปดูปลาที่สวยที่สุดของฟาร์ม
          เว้นแต่ว่าลูกค้าได้บอกงบประมาณไปก่อนหน้านี้แล้วและจะซื้อจริง ๆ
          เพราะเมื่อลูกค้าได้เห็นปลาที่สวยที่สุดแล้ว ปลาที่เหลือตัวอื่น ๆ
          ในฟาร์มก็จะดูไม่สวยในทันที
          <br />
          <br />
          4. Breeder มักจะไม่ตักปลาที่คุณภาพแตกต่างกันมาก ๆ
          มาไว้ในกาละมังเดียวกันเพื่อให้เลือก นี่เป็นเหตุผลในเชิงจิตวิทยา
          เพราะการเลือกปลาเป็นเรื่องของการเปรียบเทียบหาจุดดีจุดด้อย
          ปลาหนึ่งตัวที่อยู่ในกาละมังอาจจะดูสวย แต่เมื่อมีการตักปลาอีกตัวขึ้นมา
          ปลาตัวแรกอาจจะกลายเป็นปลาที่ไม่สวยก็ได้
          และลูกค้ามักจะเลิกสนใจปลาตัวแรกทันที ทั้ง ๆ
          ที่ก่อนหน้านั้นมีท่าทีว่าจะซื้อ ดังนั้น Breeder
          จึงมักจะตักปลาที่มีคุณภาพใกล้เคียงกันมาให้เราเลือก
          <br />
          <br />
          5. เมื่อปลาถูกส่งออกไปจากฟาร์มแล้ว
          โดยทั่วไปจะไม่มีการรับผิดชอบในเรื่องความเสียหาย ไม่มีการเคลมใด ๆ
          ทั้งสิ้น ทั้งในเรื่องสุขภาพ เจ็บป่วย ครีบหัก สีหลุด เป็นต้น
          ที่สำคัญคือไม่มีการการันตีในเรื่องเพศ
          นอกเสียจากได้การันตีกันไว้แล้วตอนซื้อ
          บางกรณีอาจจะมีการดูแลเป็นพิเศษก็ขึ้นอยู่กับเหตุผลและความสนิทสนมกับทาง
          Breeder ด้วย ทั้งนี้ทั้งนั้นขึ้นอยู่กับ Breeder แต่ละราย
          <br />
          <br />
          6. สมัยนี้หลาย ๆ Breeder จะทำการนัดหมายให้ Dealer
          ที่คุ้นเคยและเป็นลูกค้าประจำให้มาตามเวลานัด
          เพื่อที่จะเปิดขายปลาที่ลากขึ้นมาใหม่พร้อมกัน ในกรณีนี้ลูกค้าต่าง ๆ
          ก็จะเข้าไปที่ฟาร์มในเวลาเดียวกัน
          จะต้องมีการจับฉลากเพื่อเลือกปลาก่อนและหลัง ใครจับได้เบอร์แรก ๆ
          ก็จะได้เลือกก่อนเป็นคนแรก ๆ ตรงนี้เป็นเรื่องของดวงครับ
        </Typography>
        <Typography
          variant="subtitle1"
          sx={{ whiteSpace: "pre-line", marginTop: 5 }}
        >
          Mr. Taro Kataoka, CEO of Ooya Koi Farm
        </Typography>
        <Grid
          container
          spacing={2}
          sx={{ marginTop: 2, mx: { xs: 0, md: "10%", xl: "20%" } }}
        >
          <Grid size={{ xs: 12, md: 6 }}>
            <Image
              src="/img/blogs/how-to-choose-koi/blog2-0.png"
              alt="blog2-0"
              width={800}
              height={500}
              style={{
                width: "100%",
                height: "auto",
              }}
            />
          </Grid>
          <Grid size={{ xs: 12, md: 6 }}>
            <Image
              src="/img/blogs/how-to-choose-koi/blog2-1.png"
              alt="blog2-1"
              width={800}
              height={500}
              style={{
                width: "100%",
                height: "auto",
              }}
            />
          </Grid>
        </Grid>
      </Box>
    </Container>
  );
}

export default HowToChooseKoiPage;
