import { Box, Container, Typography } from "@mui/material";
import PageHeader from "../../../components/PageHeader";
import Image from "next/image";

function WhereToFindKoiPage() {
  return (
    <Container maxWidth="lg">
      <Box sx={{ marginX: "8%" }}>
        <PageHeader text="ไปตามหาปลาคาร์ฟที่ญี่ปุ่น ไปที่ไหนกันดี" />
      </Box>

      <Box sx={{ marginY: 10, marginX: "10%" }}>
        <Typography
          variant="body1"
          sx={{ whiteSpace: "pre-line", marginTop: 5 }}
        >
          ซื้อปลาที่ญี่ปุ่น มีขั้นตอนนำเข้าอย่างไรบ้าง
          และต้องรอนานแค่ไหนกว่าลูกค้าจะสามารถรับปลาไปเลี้ยงได้
          ช่วงนี้เป็นช่วงเวลาที่ธุรกิจซื้อขายปลาคาร์ฟที่ญี่ปุ่นคึกคักมาก
          แต่ละฟาร์ม แต่ละ Breeder ทยอยนำปลาขึ้นจากบ่อดิน (Ikeage) เพื่อมาให้
          Dealer และคนรักปลาคาร์ฟจากทั่วโลกเลือกซื้อกัน โดยเฉพาะปลานิไซ
          ที่ต้องบอกว่าแต่ละฟาร์มต่างงัดทีเด็ดออกมาโชว์ให้ได้ร้องว้าว!! กัน
          และแน่นอน ปลาคุณภาพดี ราคาไม่มีถูก ราคาปลาคาร์ฟสูงขึ้นทุกปี
          เนื่องค่าใช้จ่ายในการทำฟาร์มที่สูงขึ้น และจากความต้องการ (Demand)
          ของเหล่า Dealer จากทั่วโลกนั่นเอง
        </Typography>
        <Typography
          variant="body2"
          sx={{ whiteSpace: "pre-line", marginTop: 5 }}
        >
          หลังจากที่เลือกซื้อปลากันตลอดทั้ง Trip ซึ่งกินเวลากว่า 1 เดือนครึ่ง
          ก็ถึงเวลานำปลากลับมาเมืองไทยกันแล้ว ซึ่งกว่าจะถึงมือนักเลี้ยง
          ลองไปดูว่ามีขั้นตอนอย่างไรบ้าง ซึ่งในขั้นตอนต่าง ๆ
          ในญี่ปุ่นจะเป็นหน้าที่ของ Dealer ชาวญี่ปุ่นหรือคนกลางที่พาเราไปซื้อปลา
        </Typography>
        <Box sx={{ mx: { xs: 0, md: "20%", xl: "30%" }, my: 5 }}>
          <Image
            src="/img/blogs/where-to-find-koi/blog1-0.png"
            alt="blog1-0"
            width={800}
            height={500}
            style={{
              width: "100%",
              height: "auto",
            }}
          />
        </Box>
        <Typography variant="h4" sx={{ marginTop: 5 }}>
          Koi Mart Farm เกิดจากความหลงใหลในความงามของปลาโค่ย
        </Typography>
        <Typography
          variant="body2"
          sx={{ whiteSpace: "pre-line", marginTop: 5 }}
        >
          1. Dealer และ Breeder ทำการตรวจเช็คปลาที่เราได้ซื้อไว้
          เพื่อให้ตรงตามรายการที่เราทำการซื้อ รวมถึงเรื่องสุขภาพของปลา และทำการ
          Packing ปลาจากฟาร์ม รวบรวม และขนส่งมายังสนามบิน ซึ่งตรงนี้ทาง Dealer
          ชาวญี่ปุ่นจะทำการนัดแนะกับฟาร์มเองสำหรับการ Packing
          ปลาลงถุงและกล่องก็ขึ้นอยู่กับความเหมาะสม อย่างเช่น ปลาขนาดนิไซขนาด 40
          ซม. ขึ้นไป ก็มักจะใส่กล่องละ 4-5 ตัว เป็นต้น <br />
          <br />
          2. มีการเตรียมเอกสารจากประเทศญี่ปุ่น (ผู้ส่งออก) เช่น ใบรับรองสุขภาพ
          (Health Certificate) ซึ่งออกโดยหน่วยงานของญี่ปุ่นที่เกี่ยวข้อง
          เพื่อรับรองว่าปลามีสุขภาพดีและปลอดโรค เอกสารการค้าอื่น ๆ เช่น
          ใบยืนยันการนำเข้า และทำการจองไฟลต์บิน เป็นต้น <br />
          <br />
          3. ในส่วนของผู้นำเข้าหรือฟาร์มในประเทศไทย
          จะต้องทำเรื่องขออนุญาตินำเข้าสัตว์น้ำต่อหน่วยงานที่เกี่ยวข้อง เช่น
          กรมประมง ซึ่งจะต้องแสดงใบรับรองสุขภาพที่ทางญี่ปุ่นออกให้ <br />
          <br />
          4. เมื่อปลาขนส่งมาถึงเมืองไทย
          กรมประมงจะทำการตรวจเช็คจำนวนปลาและชนิดปลาให้ตรงกับเอกสาร
          และถ่ายรูปไว้เพื่อมา Re-check อีกครั้งว่าตรงกับเอกสารหรือไม่ <br />
          <br />
          5. ระยะเวลาที่ปลาจะต้องอยู่ในถุงที่อัดออกซิเจน เริ่มจากการ Packing
          ของฟาร์มที่ญี่ปุ่น → ขนส่งมายังสนามบินที่ญี่ปุ่น →
          ระหว่างการเดินทางด้วยเครื่องบิน →
          มาถึงสนามบินที่เมืองไทยและทำการตรวจเช็ค →
          จนกระทั่งปล่อยลงบ่อในห้องกักกันโรคของฟาร์ม รวมระยะเวลาบวกลบประมาณ
          15-18 ชั่วโมง <br />
          <br />
          6. หลังจากผ่านขั้นตอนที่ด่านกักกันสัตว์น้ำที่สนามบินแล้ว
          ปลาทั้งหมดจะถูกนำเข้าไปดูแลในห้องสำหรับกักกันโรคของแต่ละฟาร์ม
          ซึ่งสร้างตามมาตรฐานของกรมประมง หลังจากนั้นอีก 7 วัน
          กรมประมงจะส่งเจ้าหน้าที่เข้ามาตรวจเช็คปลา
          โดยเช็คจำนวนว่าตรงตามที่แสดงไว้ในเอกสารตอนนำเข้าหรือไม่
          รวมถึงตรวจสุขลักษณะของโรงเรือนสำหรับกักกัน ตรวจเช็คสุขภาพปลา
          และทำการจดบันทึก <br />
          <br /> 7. หลังจากนั้นอีก 21 วัน
          กรมประมงจะส่งเจ้าหน้าที่เข้ามาเก็บตัวอย่างจากปลาเพื่อนำไปตรวจโรค
          โดยการตัดซี่เหงือก (Gill Clipping) เพื่อนำไปตรวจหาเชื้อไวรัส KHV (Koi
          Herpes Virus) และ SVCV (Spring Viremia of Carp Virus)
          รวมถึงเชื้อแบคทีเรียและปรสิตภายนอกอื่น ๆ
          การเก็บตัวอย่างนี้จะไม่ทำกับปลาทุกตัว แต่จะเป็นการสุ่มจากปลาในแต่ละบ่อ
          (ทุกบ่อ) <br />
          <br />
          8. ระหว่างรอผลตรวจหาโรคจากห้องแล็บของกรมประมง
          ปลาที่ถูกเลี้ยงในห้องกักกันโรคของฟาร์ม
          ในเบื้องต้นจะต้องมีการควบคุมอุณหภูมิให้ใกล้เคียงกับญี่ปุ่น คือประมาณ
          18-25 องศาเซลเซียส (ด้วย Chiller)
          เพื่อไม่ให้ปลาเกิดภาวะช็อคจากอุณหภูมิที่เปลี่ยนแปลงกะทันหัน
          เกิดความเครียด และป้องกันสีหลุด และจะมีการปรับอุณหภูมิเพิ่มขึ้นเรื่อย
          ๆ ทีละนิด ๆ จนเท่ากับอุณหภูมิน้ำทั่วไปของเมืองไทย
          ในระหว่างนี้จะมีการเปลี่ยนน้ำในปริมาณที่เหมาะสม
          เพื่อไม่ให้อุณหภูมิเปลี่ยนแปลงกะทันหัน
          ในระหว่างนี้จะมีการให้อาหารที่ผสมยาปฏิชีวนะ
          เพื่อป้องกันการติดเชื้อแบคทีเรีย <br />
          <br />
          9. เมื่อทราบผลการตรวจโรคจากกรมประมงว่าปลาชุดนี้สุขภาพแข็งแรงและปลอดโรค
          ก็จะถึงเวลา “ปลดการกักกัน” หรือเรียกสั้น ๆ ว่า “ปลดกัก” แล้ว
          นั่นหมายความว่า ปลาชุดนี้จะสามารถนำออกขาย
          และส่งให้กับนักเลี้ยงได้ไปลงบ่อกันแล้ว ตรงนี้สามารถตอบคำถามที่ว่า
          “ต้องรอนานแค่ไหน กว่าจะได้เลี้ยงปลาที่นำเข้าจากญี่ปุ่น” จากขั้นตอนต่าง
          ๆ ที่ผมได้กล่าวไป จะกินเวลาประมาณ 40-45 วันครับ
          <br />
          <br />
          สำหรับปลาที่ผ่านการกักกันตามระเบียบของกรมประมงจนมั่นใจกว่าปลอดภัยและปลอดโรค
          โดยที่ยังไม่ได้ถูกนำไปเลี้ยงกับปลาชุดเก่าหรือชุดอื่นของฟาร์ม พูดตรง ๆ
          คือ ออกจากห้องกักกันสด ๆ ร้อน ๆ ผู้เลี้ยงสามารถนำไปเลี้ยงได้ทันที
          โดยไม่ต้องกักกันโรคอีกครั้ง เพราะปลาได้ผ่านการดูแลจนมีสุขภาพดีแล้ว
          ตรงนี้ผมจึงอยากจะแนะนำว่า ถ้าทางฟาร์มแจ้งว่าปลาปลดกักปุ๊บ
          ก็ควรมารับปลาที่คุณสั่งซื้อกลับบ้านทันที
          เพราะช่วงเวลานี้จะเป็นช่วงเวลาที่มั่นใจได้มากที่สุดว่าปลาจะมีสุขภาพดี
          ปลอดจากโรคนั่นเองครับ
        </Typography>
      </Box>
    </Container>
  );
}

export default WhereToFindKoiPage;
