import { Box, Container, Grid, Typography } from "@mui/material";
import PageHeader from "../../../components/PageHeader";
import Image from "next/image";

function KoiHuntingTips2() {
  return (
    <Container maxWidth="lg">
      <Box sx={{ marginX: "8%" }}>
        <PageHeader text="Koi hunting tips 2" />
      </Box>

      <Box sx={{ marginY: 10, marginX: "10%" }}>
        <Typography variant="h3">
          ฝากเลี้ยงที่ญี่ปุ่น (Azukari) ตอนที่ 2
        </Typography>
        <Grid
          container
          spacing={2}
          sx={{ marginTop: 5, display: "flex", justifyContent: "center" }}
        >
          <Grid size={{ xs: 12, sm: 4 }}>
            <Image
              src="/img/blogs/koi-hunting-tips-2/blog7-1.png"
              alt="koi-hunting-tips-2-1"
              width={800}
              height={500}
              style={{
                width: "100%",
                height: "auto",
              }}
            />
          </Grid>
          <Grid size={{ xs: 12, sm: 4 }}>
            <Image
              src="/img/blogs/koi-hunting-tips-2/blog7-2.png"
              alt="koi-hunting-tips-2-2"
              width={800}
              height={500}
              style={{
                width: "100%",
                height: "auto",
              }}
            />
          </Grid>
        </Grid>
        <Typography
          variant="body1"
          sx={{ whiteSpace: "pre-line", marginTop: 5 }}
        >
          ปลาส่วนใหญ่ที่มักจะฝากเลี้ยงต่อที่ญี่ปุ่นก็คือ ปลาที่ซื้อตอนนิไซ
          ส่วนโตไซนั้นก็มี แต่น้อย
          เพราะโตไซนั้นเป็นปลาที่ยังมีการเปลี่ยนแปลงค่อนข้างมาก คาดเดาได้ยาก
          ในขณะที่นิไซนั้นจะเป็นปลาที่ “ฉายแวว” ชัดเจนในระดับหนึ่งแล้ว
          อีกอย่างก็คือ โอกาสที่จะซื้อโตไซดีๆจากBreederนั้นเป็นเรื่องยาก เพราะ
          Breeder ต้องการเก็บเอาไว้เลี้ยงต่อ
          เพื่อให้การเช็คเพศและเห็นคุณภาพชัดเจนเสียก่อน ส่วนปลาใหญ่ๆนั้น
          มีให้เลือกไม่มาก และราคาก็แพงมากตามไปด้วย
          ดังนั้นคนจึงนิยมเลือกซื้อปลานิไซและฝากเลี้ยงต่อมากที่สุด
        </Typography>

        <Typography
          variant="body2"
          sx={{ whiteSpace: "pre-line", marginTop: 5 }}
        >
          ฤดูนิไซ เริ่มตั้งแต่เดือนตุลาคม ลากยาวไปจนถึงเดือนธันวาคม
          ในปีถัดไปในเดือนมกราคมและกุมภาพันธ์นั้นก็ยังมีให้เลือกซื้ออยู่บ้างแต่จำนวนน้อยมาก
          จะเป็นนิไซในเกรด Tateshita
          ที่Breederได้คัดออกจากปลาที่จะเก็บไว้เพื่อทำเป็นซันไซต่อไป
          ส่วนที่เห็นเป็น stock
          ในฟาร์มทั่วไปจะเป็นปลาเหลือเลือกจากช่วงเปิดฤดูกาล
          <br />
          <br />
          ปลานิไซที่นักเลี้ยงเลือกซื้อและฝากBreederเลี้ยงต่อ
          จะถูกเลี้ยงในบ่อปูนตลอดฤดูหนาวที่ปกคลุมไปด้วยหิมะ
          และแทบจะไม่กินอาหารเลย เรียกว่าเลี้ยงแบบ “จำศีล” ก็ว่าได้
          ยกเว้นปลาที่จะคอนดิชั่นเพื่อการประกวด ที่จะเป็นต้องให้อาหาร
          ก็จะถูกเลี้ยงในบ่อที่มีHeaterทำความร้อน
          <br />
          <br />
          เมื่อเข้าสู่ต้นเดือนพฤษภาคม
          ปลาเหล่านี้ก็ถูกนำไปเลี้ยงในบ่อดินที่สภาพแวดล้อมเป็นธรรมชาติ
          แต่ก็ขึ้นอยู่กับการพิจารณาของBreederและความต้องการของเจ้าของปลา
          ฟาร์มขนาดใหญ่อย่างเช่น Sakai Fish Farm
          ก็จะมีทั้งการฝากเลี้ยงในบ่อปูนและบ่อดิน
          Breederจะมีหลักในการพิจารณาว่าปลาตัวนั้นๆควรจะเลี้ยงในสภาพแวดล้อมแบบใด
          ยกตัวอย่างเช่น ปลาที่ต้องการให้มีการพัฒนาโครงสร้างและเพิ่ม Volume
          ก็จะถูกนำไปลงบ่อดิน หากเป็นปลาที่เน้นการคอนดิชั่นผิวและสี หรือเน้นการ
          Grooming ก็จะถูกเลี้ยงในบ่อปูน เพื่อให้ง่ายต่อการดูแล
          <br />
          <br />
          ปลาที่คุณภาพสูงมากๆ และราคาแพงมากๆ Breederจะแนะนำให้เลี้ยงในบ่อปูน
          เพราะการเลี้ยงในบ่อดินนั้นไม่สามารถสังเกตเห็นปลาได้ง่าย
          และมีความเสี่ยงที่จะเกิดความเสียหายหรือตายได้
          <br />
          <br />
          ปลาจะถูกเลี้ยงในบ่อดินตั้งแต่ปลายฤดูใบไม้ผลิ
          ผ่านฤดูร้อนที่สภาพอากาศเหมาะกับการเจริญเติบโตของปลา
          จนกระทั่งเดือนตุลาคมเวียนมาถึงอีกครั้ง
          ปลาที่อยู่ในบ่อดินก็จะถูกลากอวนขึ้นมาเพื่อตรวจเช็ค ช่วงเวลานี้คือความ
          “ตื่นเต้น” ของนักเลี้ยงที่นิยมฝากปลา
          เพราะจะได้เห็นว่าปลาของตนเองมีความเปลี่ยนแปลงมากน้อยแค่ไหน ใหญ่ขึ้น
          หรือสวยขึ้นหรือไม่
          <br />
          <br />
          สำหรับเงื่อนไขในการฝากปลาเพื่อเลี้ยงที่ญี่ปุ่นนั้น แต่ละฟาร์มจะมี
          Minimum price ขั้นต่ำแตกต่างกันไป
          ว่าปลาราคาเท่าไหร่ขึ้นไปถึงจะฝากเลี้ยงต่อได้ เช่น ฟาร์ม A
          หากซื้อปลาราคา 5 แสนเยนขึ้นไป จะสามารถฝากเลี้ยงฟรี 1 ปี
          และมีการรับประกันในปีแรก แต่ปีที่สองต้องเสียค่าฝาก
          แล้วรับความเสี่ยงเอง ในระหว่างช่วงรับประกันหากปลามีการตายเกิดขึ้น
          จะไม่มีการคืนเงิน
          แต่จะคืนเป็นสิทธิ์ในการเลือกปลาตัวใหม่ในราคาที่เท่ากัน
          หากต้องการซื้อปลาที่ราคาแพงกว่าตัวเก่า ก็จะต้องเพิ่มเงินส่วนต่าง
          แบบนี้เป็นต้น ส่วนปลาที่ซื้อจากงานประมูลหรืองาน event
          ต่างๆก็สามารถคืนเป็นเครดิตเพื่อใช้ประมูลปลาได้ในงานถัดๆไป
          <br />
          <br />
          มาถึงตรงนี้ หลายคนมีคำถามว่า สามารถฝากเลี้ยงได้นานแค่ไหน
          และเมื่อไหร่ควรเอากลับเมืองไทย ตรงนี้ขึ้นอยู่กับดุลยพินิจของBreeder
          ถ้าปลายังมีแนวโน้มที่จะพัฒนาต่อได้ เขาก็จะแนะนำให้ฝากเลี้ยงต่อ
          แต่ถ้าเขามองว่า ปลา “จบแล้ว” ไม่สามารถพัฒนาได้มากไปกว่านี้แล้ว
          Breederจะแนะนำให้เอากลับ
          ในกรณีหลังนี้ส่วนใหญ่นักเลี้ยงมักจะเอากลับเมืองไทย
          เพราะไม่มีประโยชน์อะไรที่จะฝากเลี้ยงต่อ เพราะยิ่งปลามีขนาดใหญ่ขึ้น
          ค่าฝากก็แพงขึ้น แต่ปลาไม่สามารถพัฒนาได้มากกว่านี้แล้ว
          <br />
          <br />
          การซื้อปลาแล้วฝากเลี้ยงต่อที่ญี่ปุ่น ในบางมุมมองอาจจะบอกว่า
          ซื้อปลาแล้วไม่ได้เลี้ยงเอง มันจะไปสนุกอะไร
          การซื้อปลาคาร์พที่คุณภาพดีราคาสูง นักเลี้ยงทุกคนซื้อด้วยความ “คาดหวัง”
          เป็นการซื้ออนาคตที่ท้าทาย บางคนอาจจะมีความสุขในการได้เลี้ยงเอง
          แต่หลายคนก็มีความสุขในการเห็นปลาสวยขึ้น และสวยขึ้นในทุกๆปี
          แต่ไม่จำเป็นต้องเลี้ยงเองก็ได้ หรืออยากจะ Challenge กับงานประกวดระดับ
          All Japan อย่างที่เราบอกตอนต้น ทุกเหตุผลไม่มีอะไรผิดอะไรถูก
          ต่างคนต่างแสวงหาความสุขจากการเลี้ยงปลาคาร์ฟในมุมของตัวเอง
          ขึ้นอยู่กับความชอบของแต่ละคนครับ
          <br />
          <br />
          ภาพ: Mature Champion @ The 57th ZNA internatilnal koi show 2021
          หลังจากที่ประมูลมาแล้วฝากเลี้ยงที่ Sakai fish farm 2ปี
          <br />
          Cr ภาพ: Jane Maneerat
          <br />
          <br />
          #ikeake2025 #koi #koimartfarm #ajks
        </Typography>
      </Box>
    </Container>
  );
}

export default KoiHuntingTips2;
